a = input('Уведіть значення першої змінної :')
b = input('Уведіть значення другої змінної :')
c = a
a = b
b = c
print('Значення першої змінної :', a)
print('Значення другої зміннох :', b)
#Заміна значень змінних через третю змінну
a = int(input('Уведіть значення першої змінної :'))
b = int(input('Уведіть значення другої змінної :'))
a = a + b
b = a - b
a = a - b
print('Значення першої змінної :', a)
print('Значення другої змінної :', b)
#Заміна значень змінних через арифметичні дії
a = int(input('Уведіть значення першої змінної :'))
b = int(input('Уведіть значення другої змінної :'))
a, b = b, a
print('Значення першої змінної :', a)
print('Значення другої змінної :', b)
#Заміна значень змінних через множину присвоювань